;エキスパートアドバイザーの単一テスト: OB_BOS_Strategy_EA, XAUUSD M5, 全ティック, 2024.01.01 - 2025.01.10
[Tester]
Expert=OB_BOS_Strategy_EA.ex5
Symbol=XAUUSD
Period=M5
Optimization=0
Model=0
FromDate=2024.01.01
ToDate=2025.01.10
ForwardMode=0
Deposit=50000
Currency=JPY
ProfitInPips=1
Leverage=500
ExecutionMode=0
OptimizationCriterion=0
Visual=0
[TesterInputs]
; === 💰 リスク管理 (保守的) ===
RiskPercent=0.6||0.1||0.100000||10.000000||N
MaxOrdersPerDirection=1||1||1||10||N
MagicNumber=123456||123456||1||1234560||N
TradeComment=OB_BOS
; === 📊 トレンドフィルター (厳格化) ===
TrendEMA_Period=295||20||1||500||N
TrendMinDistance=28||18||4||30||N
; === 📍 BOS設定 (厳選) ===
BOS_LookbackBars=18||18||4||30||N
BOS_MinBreakDistance=14.0||8.0||4.0||20.0||N
; === ⏱ OB有効期限 (短め) ===
OB_ExpiryMode=2||1||1||10||N
OB_ExpiryBars=12||12||2||22||N
OB_ExpiryMinutes=60||120||1||1200||N
; === 🎯 SL/TP設定 (安全寄り) ===
SLTP_Mode=3||1||1||10||N
ATR_Period=3||1||1||140||N
SL_ATR_Mult=1.8||1.0||0.2||5||N
TP_ATR_Mult=4.6||1.0||0.2||5||N
OB_RR_TP_Mult=1.5||2.0||0.200000||20.000000||N
MinRiskReward=1.0||1.2||0.120000||12.000000||N
; === 🛡 フィルター (厳格化) ===
MaxSpreadPoints=200||30||1||300||N
UseTradeTimeFilter=true||false||0||true||N
TradeStartHour=0||0||1||10||N
TradeEndHour=24||23||1||230||N
UseConfirmationCandle=true||false||0||true||N
; === 📈 追加フィルター (新規) ===
CheckVolatility=true||false||0||true||N
MinATRValue=3.0||3.0||0.300000||30.000000||N
MaxATRValue=20.0||20.0||2.000000||200.000000||N
